
import java.util.HashSet;
/**
 * a class for char type
 * 
 * @author wsl
 * 
 */
public class CharType
{
	static final String[] punctArray = { "!", "£¡", "\"", "£¢", "#", "££", "$", "¡ç", "%", "£¥", "&", "£¦", "'", "£§", "(",
			"£¨", ")", "£©", "*", "£ª", "+", "£«", ",", "£¬", "-", "£­", ".", "£®", "/", "£¯", ":", "£º", ";", "£»", "<", "£¼",
			"=", "£½", ">", "£¾", "?", "£¿", "@", "£À", "[", "£Û", "\\", "£Ü", "]", "£Ý", "^", "£Þ", "_", "£ß", "`", "£à", "{",
			"£û", "|", "£ü", "}", "£ý", "~", "¡«", "£¡", "£¡", "¡°", "¡°", "#", "££", "£¤", "£¤", "%", "£¥", "&", "£¦", "¡®", "¡¯",
			"£¨", "£¨", "£©", "£©", "*", "¡Á", "+", "£«", "£¬", "£¬", "-", "£­", "¡£", "¡£", "¡¢", "£Ü", "£º", "£º", "£»", "£»", "¡¶",
			"¡¶", "=", "£½", "¡·", "¡·", "£¿", "£¿", "@", "£À", "¡¾", "¡¾", "¡¿", "¡¿", "¡­¡­", "¡­¡­", "¡ª¡ª", "¡ª¡ª", "¡¤", "¡¤", "{",
			"£û", "|", "£ü", "}", "£ý", "~", "¡«", "¡±", "¡±" };

	final static String[] letterArray = { "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o",
			"p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J",
			"K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "£Á", "£Â", "£Ã", "£Ä", "£Å",
			"£Æ", "£Ç", "£È", "£É", "£Ê", "£Ë", "£Ì", "£Í", "£Î", "£Ï", "£Ð", "£Ñ", "£Ò", "£Ó", "£Ô", "£Õ", "£Ö", "£×", "£Ø", "£Ù", "£Ú",
			"£á", "£â", "£ã", "£ä", "£å", "£æ", "£ç", "£è", "£é", "£ê", "£ë", "£ì", "£í", "£î", "£ï", "£ð", "£ñ", "£ò", "£ó", "£ô", "£õ",
			"£ö", "£÷", "£ø", "£ù", "£ú" };

	final static String[] digitArray = { "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "£°", "£±", "£²", "£³", "£´",
			"£µ", "£¶", "£·", "£¸", "£¹", "Áã", "Ò¼", "·¡", "Èþ", "ËÁ", "Îé", "Â½", "Æâ", "°Æ", "¾Á", "Ê°", "°Û", "Çª", "Íò", "ÒÚ", "©–",
			"Ò»", "¶þ", "Èý", "ËÄ", "Îå", "Áù", "Æß", "°Ë", "¾Å", "Ê®", "°Ù", "Ç§", "Áã", "Ò¼", "ÙE", "Èý", "ËÁ", "Îé", "ê‘", "Æâ", "°Æ",
			"¾Á", "Ê°", "Èf" };

	public static HashSet<String> digitSet = new HashSet<String>();
	public static HashSet<String> punctSet = new HashSet<String>();
	public static HashSet<String> letterSet = new HashSet<String>();

	public static void loadCharType()
	{
		for (int i = 0; i < digitArray.length; i++)
			digitSet.add(digitArray[i]);
		for (int i = 0; i < punctArray.length; i++)
			punctSet.add(punctArray[i]);
		for (int i = 0; i < letterArray.length; i++)
			letterSet.add(letterArray[i]);
	}
}
